Revit 2027 API
ElementNode.LinkInstanceId Property
 The Id of the link instance for the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId LinkInstanceId { get; }
Public ReadOnly Property LinkInstanceId As ElementId
	Get
public:
property ElementId^ LinkInstanceId {
	ElementId^ get ();
}
member LinkInstanceId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementNode Class
Autodesk.Revit.DB Namespace